{"/about/":{"data":{"":"We are a small, welcoming community of like-minded individuals brought together by a shared passion for learning and growing with the latest technologies. Whether you’re just starting out or already on your journey in tech, you’ll find a space here to explore, connect, and thrive.\nOur mission is simple:\nTo upskill ourselves and support others on the same path by freely sharing knowledge, experiences, and resources. We believe that learning is most powerful when it’s collaborative—and that no one should be left behind in the rapidly changing world of technology.\nThere are no barriers, and no gatekeeping.\nJust a spirit of contribution, collaboration, and active participation. Everyone has something valuable to offer, whether it’s a fresh perspective, a helpful resource, or words of encouragement.\nTogether, we’re creating a community where:\nCuriosity is encouraged\nQuestions are welcomed\nLearning is continuous\nAnd growth is shared\nIf you’re passionate about technology and believe in helping others rise as you grow—you’ll fit right in.\nCheckout the Guidelines to know more","thirsty-minds-2026-goals#Thirsty Minds 2026 Goals":"[] 10 college approach ( Students reach ) - (0/10) [] 12 Workshops ( online + offline ) - (0/12) [] 24 cmdline Ebooks - (0/24) [] 24 cheatsheets/posters - (0/24) [] Weekly 1 video in YT - (0/53) [] 6 Offline meet - (0/6) [] 1 post per week in socials - (0/53) [] 1 Hackathon - (0/1) [] Goodies","what-to-expect#What to expect":"Programming series with problem solving DSA series End to End app creations Resources HUB Linux workshops Linux support"},"title":"About Us"},"/blog/betterstudents/":{"data":{"":"How a simple change of using linux as daily driver can change students perspective in engineering\nYou won’t be scared of terminal and terminal tools. You don’t have dependencies with GUI tools/editors to engineer your product. Increases your problem-solving skills when you tackle your system’s software installations and customizations. It breaks you out from the vendor lock-in software. Let you make mistakes and more importantly fix those mistakes by yourself. Since GNU/Linux don’t have a licensing/subscription cost, it is affordable for students without sacrificing the quality of software to work with. Teaches you how software works, how it interacts with OS in a fundamental way without masking them with unnecessary wrappers like proprietary software does. Let you compile your own software from code and gives you the necessary tools for the same for free. Fundamentals first approach, Keep It Short and Simple philosophy in your development and workflow. Exposure to more Open Source tools via Linux helps you find projects driven by communities. You can even download the Linux kernel code and dissect it to learn more about kernels and operating systems. Certain Linux distros teach you how to put together your system instead of defaulting to GUI. Minimal resources needed for running Linux can help you to revive your old computers so students who are economically challenged can still get a few-years-old hardware and still be able to work on it with Linux. The list goes on and on… Just to keep it short and simple, I mentioned only major points."},"title":"How GNU/Linux make students better engineers?"},"/blog/why/":{"data":{"":"Reason why you should try foss and improve your flow\nChoosing foss over proprietary software is a conscious choice one has to take.\nBut why you should consider one?\nWhen proprietary software too gets your job done and saves your day. What else free and open source software can offer. It helps us to do a lot of collaboration and collective effort of users drive the flow of the product rather than a MNC with zero regards to the end user preferences. It gives you transparency which no amount of privacy policy can offer but only open source code alone can offer It helps to customise the application / technology to our needs. So we don’t have to go through the discomfort of adapting and using one particular way or methods. It makes you faster with updates. Since open source software is developed by contributors who is also the users of the same. New features and security updates are delivered faster than any MNC company’s release cycle. It helps you learn about how things work, since the code is open you can read it, observe it, digest it on what it does and how it does. With help of forums you can discuss about the design and architecture with actual code contributors."},"title":"Why Foss ?"},"/docs/":{"data":{"":"This is a demo of the theme’s documentation layout.","hello-world#Hello, World!":"main.gopackage main import \"fmt\" func main() { fmt.Println(\"Hello, World!\") }"},"title":"Documentation"},"/docs/first-page/":{"data":{"":"A simple demo page."},"title":"Demo Page"},"/docs/folder/":{"data":{"":"Pages can be organized into folders."},"title":"Folder"},"/docs/folder/leaf/":{"data":{"":"This page is under a folder."},"title":"Leaf Page"},"/events/":{"data":{"will-be-starting-soon#Will be starting soon\u0026hellip;":"Will be starting soon…"},"title":"Events"},"/guidelines/":{"data":{"-community-guidelines#🚀 Community Guidelines":"🚀 Community GuidelinesWelcome to our tech-tinkering corner of the world! Here’s how we roll:","-tone--culture#⚡️ Tone \u0026amp; Culture":"Think of this as your experimental garage with open doors.\nLearning is messy. Failing is part of the process.\nFun? Yes. Memes? Occasional. Chaos? Controlled.\nRespect each other, share the mic, and let’s make tech less scary for everyone.","-what-we-do#✅ What We Do":"Learn, Test, Break, Build — We’re all about experimenting with tech stacks, especially the ones that seem scary to beginners or intermediate folks. Get your hands dirty. No shame in the struggle.\nSupport Open Tech — While we’re not a strict FOSS (Free and Open Source Software) group, we do operate and contribute within the FOSS spirit: freedom, collaboration, and openness.\nEncourage FOSS — We love free and open tools, and we encourage their use—but we won’t gatekeep if you’re using non-FOSS tech. Everyone’s on their own learning curve.\nTool-Agnostic Learning — Whether it’s pure FOSS, open tech, or other tools, we’re not here to draw boundaries. Our focus is on learning, experimenting, and building real things—using whatever helps best in the moment. Choose what works, share what you learn.\nShare Knowledge Freely — Tutorials, tips, hacks, fails, wins—dump it all here. This is how we grow.\nBridge Gaps — Whether you’re loaded with resources or just starting out with curiosity, this space is for mixing minds and helping each other up.","-what-we-dont-do#❌ What We Don\u0026rsquo;t Do":"No Tech Elitism — We all started somewhere. No question is “too basic.” Be kind and patient.\nNo Spam , Keep It Genuine, Share – Cool Projects \u0026 Resources Only!\nNo Hard Policing of Tools — We don’t restrict what tools you use, but if you want to contribute, we stick to FOSS for transparency and collaboration.\nNo Rigid Formalities — We’re informal, experimental, and fun. Just keep it respectful and constructive."},"title":"Guidelines"}}